strath-server/app/controllers/application_controller.rb

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
    def set_current_student
        @current_student = Student.find_by(id: session[:student_id])