strath-server/app/controllers/articles_controller.rb

    def index
        @articles = Article.where(topic: @current_student.interests)

      if @articles.empty?
         @articles = Article.all
---
SELECT "articles".* FROM "articles" WHERE "articles"."topic" = ?  [["topic", "philosophy"]]
SELECT 1 AS one FROM "articles" WHERE "articles"."topic" = ? LIMIT ?  [["topic", "philosophy"], ["LIMIT", 1]]
SELECT "articles".* FROM "articles"