strath-server/app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."sender_id" = ?  [["sender_id", 9]]
---
    def index
        # messages = Message.all
        messages = Message.where(sender_id: @current_student.id)

INSERT INTO "messages" ("content", "sender_id", "receiver_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["content", "Helooooooooooooo"], ["sender_id", 2], ["receiver_id", 1], ["created_at", "2024-07-04 21:03:16.506264"], ["updated_at", "2024-07-04 21:03:16.506264"]]
---
    def create
        message = Message.create!(message_params)