strath-server/app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages"
---
    def index
        messages = Message.all