strath-server/app/controllers/sessions_controller.rb

    def create
        student = Student.find_by(email: params[:email])
---
SELECT "students".* FROM "students" WHERE "students"."email" = ? LIMIT ?  [["email", "shfa@gmail.com"], ["LIMIT", 1]]