strath-server/app/controllers/students_controller.rb

SELECT "students".* FROM "students" WHERE "students"."course" = ?  [["course", "BBIT"]]
SELECT "students".* FROM "students" WHERE "students"."year" = ?  [["year", 4]]
---
    def index
        if params[:course]
            @@students = Student.where(course: params[:course])
        elsif params[:year]
            @@students = Student.where(year: params[:year])
        elsif params[:interests]
            @@students = Student.where(interests: params[:interests])
        elsif !(params[:course]&&params[:year]&&params[:interests])
            @@students = Student.all

INSERT INTO "students" ("name", "email", "interests", "course", "year", "available", "password_digest", "profile_image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
    def create
        student = Student.create!(student_params)